Tekla.Structures.Model.TaskWorktype
The TaskWorktype class defines a single worktype for a task object. Each task may belong to only
one worktype.

Tekla.Structures.Model.TaskWorktype.#ctor
Creates a new task worktype instance.

Tekla.Structures.Model.TaskWorktype._Name
The name of the task worktype.

Tekla.Structures.Model.TaskWorktype.Name
The name of the task worktype.

Tekla.Structures.Model.TaskWorktype.Insert
Inserts the task worktype instance in the model.
Returns: True on success.

Tekla.Structures.Model.TaskWorktype.Select
Selects the task worktype instance from the model. The identifier must be set.
Returns: True on success.

Tekla.Structures.Model.TaskWorktype.Modify
Modifies the task worktype instance in the model. The identifier must be set.
Returns: True on success.

Tekla.Structures.Model.TaskWorktype.Delete
Deletes the task worktype instance from the model. The identifier must be set.
Returns: True on success.